{
  "maps": [
    {
      "slug": "land",
      "title": "re-use vacant land",
      "label": "Geographically Weighted Regression analysis",
      "blurb": "As many rust-belt cities grapple with the challenges of shrinking populations, the City of Cleveland is at a pivotal juncture. Vacant lands, a byproduct of this demographic shift, present both a challenge and an opportunity. This study aims to evaluate the effectiveness of Cleveland’s neighborhood revitalization strategy in repurposing these lands. Utilizing the Opportunity Index compiled by the Kirwan Institute for Race and Ethnicity, along with Geographically Weighted Regression analysis, we will assess the correlation between areas of high vacancy and low opportunity. This analysis is not only pivotal for local urban development but also forms a crucial part of our application for additional program funding from the U.S. Department of Housing and Urban Development. The hypothesis driving this research posits that Cleveland’s vacant land reuse program is adept at identifying areas with high vacancy rates and low opportunity indices, thereby targeting interventions where they are most needed."
    },
    {
      "slug": "event_venue",
      "title": "event venue",
      "label": "Geocoding; Spatial analysis",
      "blurb": "This report aims to assist FLUX, an annual artist event in Pittsburgh, Pennsylvania, in identifying an optimal venue that balances both the event's budget constraints and the convenience of attendees. Our approach involved using the Average Nearest Neighbor method to analyze the addresses of past attendees to discern clusters of households. A Hot Spot analysis was also conducted to determine the most suitable zip codes based on our findings"
    },
    {
      "slug": "wc_landuse",
      "title": "wc landuse",
      "label": "Georeferencing",
      "blurb": "To gain a deeper understanding of how land use in the west campus has evolved over time and to predict its potential future changes, we compared land use situations from different periods. Additionally, we collected coordinate data for various amenities to integrate into the base map, thereby practicing georeferencing methods."
    }
  ]
}
