{
  "latest": [
    {
      "credit": "25-03. WaPo",
      "title": "China Big Bet",
      "src": "https://www.washingtonpost.com/climate-solutions/2025/03/03/china-renewable-energy-green-world-leader/",
      "type": "Enterprise"
    },
    {
      "credit": "25-02. Maine Monitor",
      "title": "Maine Funds Tracker",
      "src": "https://themainemonitor.org/arpa/",
      "type": "Enterprise"
    },
    {
      "credit": "25-01. Initium Media",
      "title": "Texas Land Bill (中文)",
      "src": "https://theinitium.com/article/20250114-international-chinese-american-commuinity-protest-against-texas-property-bill",
      "type": "Enterprise"
    },
    {
      "credit": "24-09. YiMagazine",
      "title": "TikTok E-commerce (中文)",
      "src": "https://www.cbnweek.com/article_detail/32203",
      "type": "Enterprise"
    },
    {
      "credit": "25-01. YiMagazine",
      "title": "TikTok US Ban (中文)",
      "src": "https://www.cbnweek.com/article_detail/32498",
      "type": "Breaking"
    }
  ],
  "cite": [
    {
      "credit": "Forbes, Aug. 2024",
      "intro": "Forbes dedicated half the piece to citing my research, describing it as one of “the best and most insightful pieces of research” and “a superb analysis of the Olympic medals tables”",
      "src": "https://www.forbes.com/sites/stevendesmyter/2024/08/19/post-olympics-analysis-a-reader/"
    },
    {
      "credit": "Cosmopolitan, Aug. 2024",
      "intro": "Cosmopolitan references my tracking of Team USA’s dominance of the Olympic medal table.",
      "src": "https://www.cosmopolitan.com/entertainment/tv/a61852264/who-won-the-olympics/"
    }
  ],
  "dataviz": [
    {
      "slug": "option-oportunism",
      "title": "Timing is money",
      "publication": "Business Insider",
      "time": "June, 2025",
      "filename": "options.png",
      "link": "https://www.businessinsider.com/options-opportunism-executive-stock-grant-timing-2025-6"
    },
    {
      "slug": "datacenter",
      "title": "The AI Boom",
      "publication": "Business Insider",
      "time": "June, 2025",
      "filename": "datacenter.png",
      "link": "https://www.businessinsider.com/data-centers-northern-virginia-noise-air-pollution-cost-2025-5"
    },
    {
      "slug": "china-energy",
      "title": "How China came to dominate the world in renewable energy",
      "publication": "The Washington Post",
      "time": "March, 2025",
      "filename": "chinaenergy.png",
      "description": "China now eclipses every other country in the world — including the United States — in the green technologies of the future. Here’s how it achieved this lead.",
      "content": [
        {
          "type": "text",
          "value": "<em>Read the original story and interact with the charts on Washington Post <a href=\"https://www.washingtonpost.com/climate-solutions/2025/03/03/china-renewable-energy-green-world-leader/\">here</a>.</em>"
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/wapo0304.jpg",
            "caption": "",
            "alt": "print_version_story"
          }
        }
      ]
    },
    {
      "slug": "maine-arpa",
      "title": "Dig into Maine counties’ stimulus spending with this ARPA project database",
      "publication": "Maine Monitor",
      "time": "February, 2025",
      "filename": "ARPA.webp",
      "description": "This dashboard details how the state allocated nearly $1 billion through the Maine Jobs and Recovery Plan.",
      "content": [
        {
          "type": "text",
          "value": "<em>Read the original story and interact with the charts on Maine Monitor <a href=\"https://themainemonitor.org/arpa/\">here</a>.</em>"
        },
        {
          "type": "text",
          "value": "<em>Read our methodology on Maine Monitor <a href=\"https://themainemonitor.org/arpa-methodology/\">here</a>.</em>"
        },
        {
          "type": "text",
          "value": "Maine counties received $261 million through the American Rescue Plan Act (ARPA), which pumped billions in federal funding into Maine to help government agencies respond to disruptions caused by the COVID-19 pandemic and invest in critical infrastructure. The deadline to obligate these funds was December 31, 2024, and the deadline to spend them is December 31, 2026."
        },
        {
          "type": "text",
          "value": "The U.S. Treasury Department directed local governments to use the funds to replace lost public sector revenue; respond to the pandemic’s public health and economic impacts; provide additional compensation for essential workers; invest in water, sewer, and broadband infrastructure; provide emergency relief from natural disasters; support transportation projects; and support community development programs."
        },
        {
          "type": "text",
          "value": "This <a href=\"https://www.maine.gov/jobsplan/dashboard\">dashboard</a> details how the state allocated nearly $1 billion through the Maine Jobs and Recovery Plan. Counties’ spending decisions have proved harder to track. Because <a href=\"https://themainemonitor.org/awash-in-federal-cash-maine-counties-ponder-limited-ways-to-spend-it/\">county governments in Maine</a> perform fewer functions than counties in many other states, there is less infrastructure to oversee the funds — which for many of them represented an unprecedented windfall."
        },
        {
          "type": "text",
          "value": "The Maine Monitor reached out to representatives from all 16 counties with questions about their ARPA spending and received a wide range of responses: some were able to provide quarterly reports and color-coded budget documents, others were less forthcoming, for instance simply noting “$10,000,000 for County needs.”"
        },
        {
          "type": "text",
          "value": "To get a better picture of their budgets, The Maine Monitor worked with the Investigative Reporting Workshop to analyze data from quarterly reports submitted to the Treasury Department. This data is up to date through the end of September 2024, the latest that’s available. It does not reflect the final spending decisions made in the last three months of the year, but it accounts for more than 90% of the allocated funds."
        },
        {
          "type": "text",
          "value": "Below, you can explore how Maine counties have chosen to spend their ARPA funds."
        }
      ]
    },
    {
      "slug": "oyster",
      "title": "Maryland Is Bringing Back Oysters; Will Global Warming Ruin a Decade of Work?",
      "publication": "Personal Project",
      "time": "January, 2025",
      "filename": "oyster.jpg",
      "link": "<a href=\"https://md-oysters.vercel.app/\">https://md-oysters.vercel.app/</a>",
      "content": [
        {
          "type": "text",
          "value": "<em>Read the story<a href=\"https://md-oysters.vercel.app/\"> here</a>.</em>"
        }
      ]
    },
    {
      "slug": "small-countries-olympic-medals",
      "title": "How tiny countries find the Olympic podium",
      "publication": "The Washington Post",
      "time": "August, 2024",
      "filename": "medal_1.jpg",
      "description": "Low-cost-of-entry sports and new sports open opportunities for small countries to break through, a Post analysis found.",
      "content": [
        {
          "type": "text",
          "value": "<em>Read the original story on The Washington Post <a href=\"https://www.washingtonpost.com/sports/olympics/2024/08/09/small-countries-olympic-medals/\">here</a>.</em>"
        },
        {
          "type": "text",
          "value": "In the Olympics, size really does matter."
        },
        {
          "type": "text",
          "value": "Big countries — those with the most people and the most robust economies — tend to dominate the Games. But that doesn’t mean there aren’t places where smaller nations can show their might."
        },
        {
          "type": "text",
          "value": "We analyzed data from the 1972 Munich Games to the 2021 Tokyo Games and found that low-cost-of-entry sports, the addition of new sports to the Games and specialization in just a handful of events sometimes can be a country’s ticket to Olympic success."
        },
        {
          "type": "text",
          "value": "<h2>Dominating vs. left out</h2>"
        },
        {
          "type": "text",
          "value": "It’s true that you often hear the national anthems of the United States, China, and Russia at the Olympic Games. We found that 10 countries — with those three at the top — have won almost half of all medals in the past 50 years. When we look only at gold medals, we see similar results."
        },
        {
          "type": "text",
          "value": "With Russia out of the Paris games, United States, China and host country France lead this year’s medal count list entering Thursday."
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/medal_1.PNG",
            "caption": "",
            "alt": "medal_index"
          }
        },
        {
          "type": "text",
          "value": "In contrast, 72 countries haven’t won a single medal in the past 50 years. Most have relatively small populations — 46 of them fall into the bottom half of countries by population. Their economies, measured by gross domestic product per capita, also are often on the lower end. None of the countries without medals have both their GDP per capita and population in the top half."
        },
        {
          "type": "text",
          "value": "<h2>Economics dictate which sports rule</h2>"
        },
        {
          "type": "text",
          "value": "Wealthier countries perform much better in swimming, sailing, cycling, and equestrian events — sports that rely not only on the athletes themselves but also on equipment, coaching, and training opportunities. For example, in sailing, countries with extensive coastlines and the ability to afford yachts — such as Denmark, Sweden, the United States and Australia — often dominate. In equestrian jumping, European countries with historic traditions in the sport and the means to maintain horses, such as Germany, Switzerland, the Netherlands and Sweden, are more likely to win medals."
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/medal_2.PNG",
            "caption": "",
            "alt": "medal_dominate"
          }
        },
        {
          "type": "text",
          "value": "Countries with lesser economies tend to specialize in sports that don’t require complex equipment or venues — such as wrestling, weightlifting and taekwondo, or ball sports ranging from table tennis to volleyball."
        },
        {
          "type": "text",
          "value": "“The barriers to entering the sport are relatively low, more will try it out, and more will then be identified as potential Olympians,\" said David Forrest, a professor at the University of Liverpool who has researched sports economics."
        },
        {
          "type": "text",
          "value": "Some countries dominate through this approach. For example, China over the past 50 years has won a third of all diving medals and more than half the podium spots in table tennis. Brazil has led the world in both volleyball and beach volleyball, winning 14 percent and 31 percent of all medals, respectively."
        },
        {
          "type": "text",
          "value": "But money isn’t everything. Some countries with high GDP still don’t see success at the Games. For example, wealthy Singapore has only won four medals, and Iceland three, since 1972. Similarly, Saudi Arabia and the UAE have only won four and two medals, respectively."
        },
        {
          "type": "text",
          "value": "<h2>A single route to success</h2>"
        },
        {
          "type": "text",
          "value": "Another way countries can ascend to the podium is to concentrate on a single sport. We found that 37 countries in the past 50 years won all their medals in just one sport. Even more countries regularly medal in only a couple of sports."
        },
        {
          "type": "text",
          "value": "For instance, all the medals Afghanistan and Kosovo have won are in taekwondo and judo. Kenya, Jamaica and Ethiopia shine in the track and field. Those countries have won 97, 78 and 54 track and field medals, respectively."
        },
        {
          "type": "text",
          "value": "Over half of Iran’s and Azerbaijan’s medals are from wrestling, while field hockey accounts for 80 percent of Pakistan’s medals — and all three of its gold medals."
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/medal_3.PNG",
            "caption": "",
            "alt": "rich_poor"
          }
        },
        {
          "type": "text",
          "value": "<h2> New sports can give some a chance to shine </h2>"
        },
        {
          "type": "text",
          "value": "Since 2000, 10 new sports have become official Olympic events."
        },
        {
          "type": "text",
          "value": "It turns out that medal distribution in new sports is usually monopolized by just a few countries. For example, in triathlon, which was added in 2000, Britain, Australia and Switzerland have claimed more than 45 percent of the top spots. In rugby sevens, introduced in 2016, island countries in the South Pacific — Fiji and New Zealand — have won half of the medals awarded. In Paris this year, New Zealand women’s team won gold, while the Fiji men’s team earned silver."
        },
        {
          "type": "text",
          "value": "In cycling BMX racing, which became an Olympic event in 2008, Colombia, the United States and the Netherlands have taken more than 60 percent of the spots on the podium."
        },
        {
          "type": "text",
          "value": "New sports have the potential to significantly impact the medal picture. India has only won 23 medals since 1972, in part because cricket dominates Indian sports and society, attracting the country’s male athletes with its high financial rewards while diverting talent away from other sports. Cricket will return in the Los Angeles Olympics in 2028."
        },
        {
          "type": "text",
          "value": "Removing sports can also cause issues. “Boxing awards lots of medals and is another one of the ‘democratic’ sports. If it is removed from L.A., this will decrease chances of Third World countries winning medals,” Forrest said. The International Olympic Committee’s ongoing feud with the International Boxing Association has raised questions about whether boxing will remain an Olympic sport 2028."
        },
        {
          "type": "text",
          "value": "<h2> Emerging powers </h2>"
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/medal_4.PNG",
            "caption": "",
            "alt": "emerging countries"
          }
        },
        {
          "type": "text",
          "value": "If you’re tired of seeing Olympic medals dominated by a few superpowers, we’ve identified ten countries that won their first medals after 1980 and now have performed well in the past three Olympics. For example, Indonesia didn’t win any medals until 1988, but now its athletes regularly reach the podium in weightlifting and badminton. Qatar and Bahrain each won their first medals in 2012, and now have both been on the podium in the past three games."
        },
        {
          "type": "text",
          "value": "<h3> Methodology </h3>"
        },
        {
          "type": "text",
          "value": "The Post used medal data from the 1972 Munich Olympics to the 2020 Tokyo Olympics from Olympedia."
        },
        {
          "type": "text",
          "value": "Medals won by the Russian Olympic Committee in 2020 were included in Russia’s total. We used 2021 economic indicators to evaluate the 2020 Tokyo Olympics."
        },
        {
          "type": "text",
          "value": "Given the large time span, we assigned GDP-per-capita to each sport’s medalists, then used percentiles to differentiate between high-GDP-per-capita and low-GDP-per-capita countries. We focused our analysis on sports where the differences between high GDP and low GDP countries’ outcomes are most pronounced."
        },
        {
          "type": "text",
          "value": "In weighing emerging Olympic power countries, we excluded countries that emerged after the collapse of the Soviet Union and breakup of Yugoslavia and Czechoslovakia. To avoid one-time flukes, we used two standards: emerging countries needed to have won medals in the past three consecutive Olympics or have won four or more medals in the last two games."
        }
      ]
    },
    {
      "slug": "usa-gold-medals-paris-olympics-2024",
      "title": "All the ways Team USA dominated the Olympic medal table",
      "heading": "Team USA Paris Olympics | The Post",
      "publication": "The Washington Post",
      "time": "August 11, 2024",
      "filename": "USA_3.png",
      "description": "More than 40 percent of U.S. Olympians will leave Paris with a medal.",
      "content": [
        {
          "type": "text",
          "value": "<em>Read the original story on The Washington Post <a href=\"https://www.washingtonpost.com/sports/olympics/2024/08/11/usa-gold-medals-paris-olympics-2024/\">here</a>. </em>"
        },
        {
          "type": "text",
          "value": "PARIS — All 1,039 medals of the Olympic Games have been awarded, and the United States is leaving Paris with more than any other nation."
        },
        {
          "type": "text",
          "value": "The Americans won 126 medals, and because of team sports and relays, more than 40 percent of the team’s delegation of nearly 600 athletes received at least one. Forty-four American athletes won multiple medals and 110 won at least one gold, with that large number stemming from the country’s success in team events. In the final medal count, which awards one medal per event, the United States tied with China with 40 golds."
        },
        {
          "type": "text",
          "value": "All of the U.S. athletes who won at least four medals here are women — five swimmers, plus gymnast Simone Biles. If the medals are weighted based on the number of athletes on a team — for instance, a five-person gymnastics team on the podium would count as 0.2 medals per person — swimmer Regan Smith tops the U.S. ranks. Smith won three individual silver medals and two golds in relay events."
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/USA_1.png",
            "caption": "",
            "alt": "winner"
          }
        },
        {
          "type": "text",
          "value": "Athletes hailing from 41 states — plus one from the U.S. Virgin Islands — won medals for the United States."
        },
        {
          "type": "text",
          "value": "About one-fifth of U.S. athletes named California as their home state, and 48 of those Olympians left the Games with a medal. The majority was part of a team that finished on the podium, including the 12 Californians on the bronze-winning men’s water polo squad."
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/USA_2.png",
            "caption": "States with higher suicide rates are concentrated in the Midwest.",
            "alt": "state"
          }
        },
        {
          "type": "text",
          "value": "Montana and Alaska, which each had athletes claim at least three medals, ended the Games with the highest per capita haul."
        },
        {
          "type": "text",
          "value": "When weighted to account for the size of medal-winning teams, the D.C. metropolitan area contributed more to the U.S. medal count than any other region. Eleven athletes from the D.C. region — including sprinter Noah Lyles (Alexandria) and swimmers Katie Ledecky (Bethesda) and Torri Huske (Arlington) — won 19 medals in 18 events. Ledecky and Erin Gemmell (Potomac) were part of the team that claimed a silver medal in the women’s 4x200-meter freestyle."
        },
        {
          "type": "text",
          "value": "Smaller places such as Reno, Nev., (four medals from three athletes) and the Indianapolis region (eight medals from six athletes) outperformed their population size."
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/USA_3.png",
            "caption": "States with higher suicide rates are concentrated in the Midwest.",
            "alt": "metro"
          }
        },
        {
          "type": "text",
          "value": "While the United States topped the global medal standings, it finished 47th in medal count when population is taken into consideration. Usually, tiny countries that sometimes win just a single medal land near the top of these per capita rankings, but some larger nations, such as New Zealand, Hungary and Australia, also overperformed in Paris."
        },
        {
          "type": "text",
          "value": "<center><b>Caribbean island countries topped the per capita medal standings</b></center>"
        },
        {
          "type": "text",
          "value": "<center>Among countries with a population of at least 1 million, New Zealand won the most medals per capita.</center>"
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/USA_4.png",
            "caption": "States with higher suicide rates are concentrated in the Midwest.",
            "alt": "country"
          }
        }
      ]
    },
    {
      "slug": "ChinaAI",
      "title": "Hiring data tells you Top 10 Chinese Company in the race to hire AI Talent",
      "publication": "The Abacus",
      "time": "December 2023",
      "filename": "AI_talent1.jpg",
      "content": [
        {
          "type": "text",
          "value": "<em>This visualization was created using D3.js. Read the original story on The Abacus <a href=\"https://theabacus.substack.com/p/hiring-data-tells-you-top-10-chinese\">here</a>.</em>"
        },
        {
          "type": "text",
          "value": "I used MaiMai's report, a leading Chinese recruitment site, to analyze the AI job market and talent strategies of Chinese companies. Their latest insights (as of Oct 23) were quite revealing."
        },
        {
          "type": "text",
          "value": "First, let's look at the most in-demand AI positions in China. MaiMai's Talent supply-demand rate reveals that for two consecutive years, Autonomous Driving Systems Engineer, with a supply-demand ratio of 0.38, is the most sought-after role. This means there are about 2 candidates for every 5 positions."
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/AI_talent2.webp",
            "caption": "",
            "alt": "major-Chinese-company"
          }
        },
        {
          "type": "text",
          "value": "While there's some easing in AI role shortages compared to 2022, with speech recognition and AI engineers catching up quickly, algorithm engineers still have a supply-demand ratio below 0.5."
        },
        {
          "type": "text",
          "value": "And we have some new positions this year: ChatGPT Researchers! I wasn't sure what this job entails, so I checked some job search apps. The descriptions are vague, mostly about training chatbots for specific applications using ChatGPT. Despite the ambiguity, ChatGPT Researchers top the high-salary list with an average monthly wage of $10,000. (I promise to find some ChatGPT researchers to talk to for a future story!)"
        },
        {
          "type": "text",
          "value": "Next, let's check out the top 10 Chinese companies racing for AI talent."
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/ AI_talent3.webp",
            "caption": "",
            "alt": "AI position"
          }
        },
        {
          "type": "text",
          "value": "ByteDance is at the top again for posting the most AI jobs, even though they've slowed down a bit in the last two years. According to the report, this tech giant is a major player in the internet industry for both attracting and sourcing talent."
        },
        {
          "type": "text",
          "value": "Even smaller internet firms like Xiaohongshu and Meituan are diving into the AI talent hunt."
        },
        {
          "type": "text",
          "value": "As the chart shows, Alibaba's back in the game, picking up the pace in AI hiring. With their new CEO, Eddie Yongming Wu, on board since September, they're all about putting users first and driving with AI. Their AI job posts have shot up 4.6 times since 2022. Most of these gigs are at their e-commerce giant TaoTian Group, where they're crazy about hiring algorithm engineers – the demand's grown more than ten times over the past year"
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/AI_talent1.webp",
            "caption": "",
            "alt": "AI talent race"
          }
        }
      ]
    },
    {
      "slug": "arizona_heat",
      "title": "Extreme Heat And Migration: Insights From The Arizona Border",
      "publication": "School Project",
      "time": "2023 Fall",
      "filename": "Arizona_heat.jpg",
      "content": [
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/Arizona_heat.jpg",
            "caption": "",
            "alt": "Arizona Heat"
          }
        },
        {
          "type": "text",
          "value": "The US Southwestern border is increasingly recognized as one of the world's most perilous land crossings. Alongside the myriad challenges faced by undocumented migrants, extreme heatwaves have emerged as a formidable barrier. Recently, there's been an increase in deaths caused by extreme heat, as noted by U.S. Customs and Border Protection."
        },
        {
          "type": "text",
          "value": "As a data reporter, I hope to provide more quantitative analysis and map visualizations to support these migrant stories. My project aims to understand how rising global temperatures affect migrant movements in this region. It will look at how water and emergency beacons are spread across the area, with the goal of finding ways to make the journey safer for migrants."
        },
        {
          "type": "text",
          "value": "Firstly, here is some background. I gathered weather data from NOAA and migrant information from the International Organization for Migration (IOM) and used R to analyze them. As Figure 1 shows, from 2019 to 2023, during the hottest months of June to September, there has been a notable increase in deaths among migrants trying to cross borders without permission. So, how do rising temperatures influence migration patterns along the Arizona border?"
        },
        {
          "type": "text",
          "value": "We define missing migrants as individuals who attempt to cross borders without authorization and are later found deceased by non-governmental organizations (NGOs) or patrol officers, without definitive identification at the time of discovery. Heat-related missing migrants are those whose deaths are inferred to be caused by heat, after excluding known causes like violence or drowning."
        },
        {
          "type": "text",
          "value": "Since data on missing migrants is difficult to obtain and the specific reasons for their disappearance are often unknown, I reached out to the International Organization for Migration and an Arizona local NGO, Humane Borders, for their datasets. To increase accuracy, I focused on missing migrant cases from June to September, the hottest months in Arizona. I also narrowed down the data to include cases that could be related to heat-related causes of death."
        },
        {
          "type": "text",
          "value": "Figure 2 provides very rich information, through this map, we can get some facts about Arizona: 1) Arizona is characterized by limited water sources and cities concentrated in the central region. 2) Tucson has become one of the fastest-growing cities in recent years due to immigration. 3) It has two patrol stations. 4) Rescue Beacons are primarily located in the lower-left corner, in Yuma County."
        },
        {
          "type": "text",
          "value": "I use the Heat Index and Geographically Weighted Regression (GWR) as the main methods for this research. For my research on the impact of heat, I initially planned to use temperature and other weather data. However, I realized that this data might not clearly show trends over five years."
        },
        {
          "type": "text",
          "value": "Then, I discovered the Heat Index in a research paper. Heat Index made by the nonprofit First Street Foundation, calculates the heat risk facing each property in the contiguous United States over the next 30 years, the length of a typical mortgage, providing some of the most detailed nationwide estimates. It uses an average temperature value over seven years, making it a more objective choice for my project. To analyze the data, I'm applying a weighted approach to the Heat Index."
        },
        {
          "type": "text",
          "value": "As the map indicates, the deep red areas represent the hottest regions, while the lighter colored areas are relatively cooler. However, it's important to note that when looking at the national map, Arizona tends to be overall warmer in the summer. The colorful points on the map represent missing migrants, with different colors indicating different years."
        },
        {
          "type": "text",
          "value": "Finally, I conducted a Geographically Weighted Regression (GWR), combining factors such as heat, distance from cities, and the presence of rescue beacons, to see how they influence migrant safety. I gained some insights from the results. Migrants should avoid walking in the FID4, 1, and 51 census tracts to minimize health risks. Additionally, NGOs and the US Border Patrol should consider installing more beacons eastward to enhance safety."
        },
        {
          "type": "text",
          "value": "So far, this is all my work. I sent the results to Humane Borders, hoping it can contribute to their efforts in helping undocumented immigrants protect their lives. Of course, this project has many limitations, such as my inability to verify the migrant data since statistics on heat-related deaths are hard to compile. Also, the heat index data was last updated in July, not including data for August and September."
        },
        {
          "type": "text",
          "value": "In the future, I aim to extend the study to encompass the entire US southern border for a more comprehensive analysis."
        }
      ]
    }
  ],
  "blog": [
    {
      "slug": "arpa",
      "title": "What I Learned from the ARPA Project",
      "time": "December, 2024",
      "filename": "arpa_treasury.jpg",
      "description": "The project dealt with messy government data and a ton of manual coding. Data validation? A must.",
      "content": []
    }
  ]
}
