{
  "latest": [
    {
      "credit": "YiMagazine, Jan. 2025",
      "title": "TikTok's 75-Day \"Lifeline\": Chinese E-commerce Sellers Face a Crossroad (中文)",
      "src": "https://www.cbnweek.com/article_detail/32498",
      "type": "Breaking"
    },
    {
      "credit": "Initium Media, Jan. 2025",
      "title": "How a Land Bill Awakened Political Awareness in Texas’s Chinese American Community  (中文)",
      "src": "https://theinitium.com/article/20250114-international-chinese-american-commuinity-protest-against-texas-property-bill",
      "type": "Feature"
    },
    {
      "credit": "YiMagazine, September Issue 2024",
      "title": "TikTok E-commerce: A Race Against the Clock (中文)",
      "src": "https://www.cbnweek.com/article_detail/32203",
      "type": "Investigation"
    }
  ],
  "cite": [
    {
      "credit": "Forbes, Aug. 2024",
      "intro": "Forbes dedicated half the piece to citing my research, describing it as one of “some of the best and most insightful pieces of research” and “a superb analysis of the Olympic medals tables”",
      "src": "https://www.forbes.com/sites/stevendesmyter/2024/08/19/post-olympics-analysis-a-reader/"
    },
    {
      "credit": "Cosmopolitan, Aug. 2024",
      "intro": "Cosmopolitan references my tracking of Team USA’s dominance of the Olympic medal table.",
      "src": "https://www.cosmopolitan.com/entertainment/tv/a61852264/who-won-the-olympics/"
    }
  ],
  "dataviz": [
    {
      "slug": "maine-arpa",
      "title": "Dig into Maine counties’ stimulus spending with this ARPA project database",
      "publication": "Maine Monitor",
      "time": "February 9, 2025",
      "filename": "ARPA.webp",
      "description": "This dashboard details how the state allocated nearly $1 billion through the Maine Jobs and Recovery Plan.",
      "content": [
        {
          "type": "text",
          "value": "<em>Read the original story and interact with the charts on Maine Monitor <a href=\"https://themainemonitor.org/arpa/\">here</a>.</em>"
        },
        {
          "type": "text",
          "value": "<em>Read our methodology on Maine Monitor <a href=\"https://themainemonitor.org/arpa-methodology/\">here</a>.</em>"
        },
        {
          "type": "text",
          "value": "<em>Read my blog about this story <a href=\"https://jinpengli.com/blog/arpa.html\">here</a>.</em>"
        },
        {
          "type": "text",
          "value": "Maine counties received $261 million through the American Rescue Plan Act (ARPA), which pumped billions in federal funding into Maine to help government agencies respond to disruptions caused by the COVID-19 pandemic and invest in critical infrastructure. The deadline to obligate these funds was December 31, 2024, and the deadline to spend them is December 31, 2026."
        },
        {
          "type": "text",
          "value": "The U.S. Treasury Department directed local governments to use the funds to replace lost public sector revenue; respond to the pandemic’s public health and economic impacts; provide additional compensation for essential workers; invest in water, sewer, and broadband infrastructure; provide emergency relief from natural disasters; support transportation projects; and support community development programs."
        },
        {
          "type": "text",
          "value": "This <a href=\"https://www.maine.gov/jobsplan/dashboard\">dashboard</a> details how the state allocated nearly $1 billion through the Maine Jobs and Recovery Plan. Counties’ spending decisions have proved harder to track. Because <a href=\"https://themainemonitor.org/awash-in-federal-cash-maine-counties-ponder-limited-ways-to-spend-it/\">county governments in Maine</a> perform fewer functions than counties in many other states, there is less infrastructure to oversee the funds — which for many of them represented an unprecedented windfall."
        },
        {
          "type": "text",
          "value": "The Maine Monitor reached out to representatives from all 16 counties with questions about their ARPA spending and received a wide range of responses: some were able to provide quarterly reports and color-coded budget documents, others were less forthcoming, for instance simply noting “$10,000,000 for County needs.”"
        },
        {
          "type": "text",
          "value": "To get a better picture of their budgets, The Maine Monitor worked with the Investigative Reporting Workshop to analyze data from quarterly reports submitted to the Treasury Department. This data is up to date through the end of September 2024, the latest that’s available. It does not reflect the final spending decisions made in the last three months of the year, but it accounts for more than 90% of the allocated funds."
        },
        {
          "type": "text",
          "value": "Below, you can explore how Maine counties have chosen to spend their ARPA funds."
        }
      ]
    },
    {
      "slug": "oyster",
      "title": "Maryland Is Bringing Back Oysters; Will Global Warming Ruin a Decade of Work?",
      "publication": "Personal Project",
      "time": "January, 2025",
      "filename": "oyster.jpg",
      "link": "<a href=\"https://md-oysters.vercel.app/\">https://md-oysters.vercel.app/</a>",
      "content": [
        {
          "type": "text",
          "value": "<em>Read the story<a href=\"https://md-oysters.vercel.app/\"> here</a>.</em>"
        }
      ]
    },
    {
      "slug": "small-countries-olympic-medals",
      "title": "How tiny countries find the Olympic podium",
      "publication": "The Washington Post",
      "time": "August 9, 2024",
      "filename": "medal_1.jpg",
      "description": "Low-cost-of-entry sports and new sports open opportunities for small countries to break through, a Post analysis found.",
      "content": [
        {
          "type": "text",
          "value": "<em>Read the original story on The Washington Post <a href=\"https://www.washingtonpost.com/sports/olympics/2024/08/09/small-countries-olympic-medals/\">here</a>.</em>"
        },
        {
          "type": "text",
          "value": "In the Olympics, size really does matter."
        },
        {
          "type": "text",
          "value": "Big countries — those with the most people and the most robust economies — tend to dominate the Games. But that doesn’t mean there aren’t places where smaller nations can show their might."
        },
        {
          "type": "text",
          "value": "We analyzed data from the 1972 Munich Games to the 2021 Tokyo Games and found that low-cost-of-entry sports, the addition of new sports to the Games and specialization in just a handful of events sometimes can be a country’s ticket to Olympic success."
        },
        {
          "type": "text",
          "value": "<h2>Dominating vs. left out</h2>"
        },
        {
          "type": "text",
          "value": "It’s true that you often hear the national anthems of the United States, China, and Russia at the Olympic Games. We found that 10 countries — with those three at the top — have won almost half of all medals in the past 50 years. When we look only at gold medals, we see similar results."
        },
        {
          "type": "text",
          "value": "With Russia out of the Paris games, United States, China and host country France lead this year’s medal count list entering Thursday."
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/medal_1.PNG",
            "caption": "",
            "alt": "medal_index"
          }
        },
        {
          "type": "text",
          "value": "In contrast, 72 countries haven’t won a single medal in the past 50 years. Most have relatively small populations — 46 of them fall into the bottom half of countries by population. Their economies, measured by gross domestic product per capita, also are often on the lower end. None of the countries without medals have both their GDP per capita and population in the top half."
        },
        {
          "type": "text",
          "value": "<h2>Economics dictate which sports rule</h2>"
        },
        {
          "type": "text",
          "value": "Wealthier countries perform much better in swimming, sailing, cycling, and equestrian events — sports that rely not only on the athletes themselves but also on equipment, coaching, and training opportunities. For example, in sailing, countries with extensive coastlines and the ability to afford yachts — such as Denmark, Sweden, the United States and Australia — often dominate. In equestrian jumping, European countries with historic traditions in the sport and the means to maintain horses, such as Germany, Switzerland, the Netherlands and Sweden, are more likely to win medals."
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/medal_2.PNG",
            "caption": "",
            "alt": "medal_dominate"
          }
        },
        {
          "type": "text",
          "value": "Countries with lesser economies tend to specialize in sports that don’t require complex equipment or venues — such as wrestling, weightlifting and taekwondo, or ball sports ranging from table tennis to volleyball."
        },
        {
          "type": "text",
          "value": "“The barriers to entering the sport are relatively low, more will try it out, and more will then be identified as potential Olympians,\" said David Forrest, a professor at the University of Liverpool who has researched sports economics."
        },
        {
          "type": "text",
          "value": "Some countries dominate through this approach. For example, China over the past 50 years has won a third of all diving medals and more than half the podium spots in table tennis. Brazil has led the world in both volleyball and beach volleyball, winning 14 percent and 31 percent of all medals, respectively."
        },
        {
          "type": "text",
          "value": "But money isn’t everything. Some countries with high GDP still don’t see success at the Games. For example, wealthy Singapore has only won four medals, and Iceland three, since 1972. Similarly, Saudi Arabia and the UAE have only won four and two medals, respectively."
        },
        {
          "type": "text",
          "value": "<h2>A single route to success</h2>"
        },
        {
          "type": "text",
          "value": "Another way countries can ascend to the podium is to concentrate on a single sport. We found that 37 countries in the past 50 years won all their medals in just one sport. Even more countries regularly medal in only a couple of sports."
        },
        {
          "type": "text",
          "value": "For instance, all the medals Afghanistan and Kosovo have won are in taekwondo and judo. Kenya, Jamaica and Ethiopia shine in the track and field. Those countries have won 97, 78 and 54 track and field medals, respectively."
        },
        {
          "type": "text",
          "value": "Over half of Iran’s and Azerbaijan’s medals are from wrestling, while field hockey accounts for 80 percent of Pakistan’s medals — and all three of its gold medals."
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/medal_3.PNG",
            "caption": "",
            "alt": "rich_poor"
          }
        },
        {
          "type": "text",
          "value": "<h2> New sports can give some a chance to shine </h2>"
        },
        {
          "type": "text",
          "value": "Since 2000, 10 new sports have become official Olympic events."
        },
        {
          "type": "text",
          "value": "It turns out that medal distribution in new sports is usually monopolized by just a few countries. For example, in triathlon, which was added in 2000, Britain, Australia and Switzerland have claimed more than 45 percent of the top spots. In rugby sevens, introduced in 2016, island countries in the South Pacific — Fiji and New Zealand — have won half of the medals awarded. In Paris this year, New Zealand women’s team won gold, while the Fiji men’s team earned silver."
        },
        {
          "type": "text",
          "value": "In cycling BMX racing, which became an Olympic event in 2008, Colombia, the United States and the Netherlands have taken more than 60 percent of the spots on the podium."
        },
        {
          "type": "text",
          "value": "New sports have the potential to significantly impact the medal picture. India has only won 23 medals since 1972, in part because cricket dominates Indian sports and society, attracting the country’s male athletes with its high financial rewards while diverting talent away from other sports. Cricket will return in the Los Angeles Olympics in 2028."
        },
        {
          "type": "text",
          "value": "Removing sports can also cause issues. “Boxing awards lots of medals and is another one of the ‘democratic’ sports. If it is removed from L.A., this will decrease chances of Third World countries winning medals,” Forrest said. The International Olympic Committee’s ongoing feud with the International Boxing Association has raised questions about whether boxing will remain an Olympic sport 2028."
        },
        {
          "type": "text",
          "value": "<h2> Emerging powers </h2>"
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/medal_4.PNG",
            "caption": "",
            "alt": "emerging countries"
          }
        },
        {
          "type": "text",
          "value": "If you’re tired of seeing Olympic medals dominated by a few superpowers, we’ve identified ten countries that won their first medals after 1980 and now have performed well in the past three Olympics. For example, Indonesia didn’t win any medals until 1988, but now its athletes regularly reach the podium in weightlifting and badminton. Qatar and Bahrain each won their first medals in 2012, and now have both been on the podium in the past three games."
        },
        {
          "type": "text",
          "value": "<h3> Methodology </h3>"
        },
        {
          "type": "text",
          "value": "The Post used medal data from the 1972 Munich Olympics to the 2020 Tokyo Olympics from Olympedia."
        },
        {
          "type": "text",
          "value": "Medals won by the Russian Olympic Committee in 2020 were included in Russia’s total. We used 2021 economic indicators to evaluate the 2020 Tokyo Olympics."
        },
        {
          "type": "text",
          "value": "Given the large time span, we assigned GDP-per-capita to each sport’s medalists, then used percentiles to differentiate between high-GDP-per-capita and low-GDP-per-capita countries. We focused our analysis on sports where the differences between high GDP and low GDP countries’ outcomes are most pronounced."
        },
        {
          "type": "text",
          "value": "In weighing emerging Olympic power countries, we excluded countries that emerged after the collapse of the Soviet Union and breakup of Yugoslavia and Czechoslovakia. To avoid one-time flukes, we used two standards: emerging countries needed to have won medals in the past three consecutive Olympics or have won four or more medals in the last two games."
        }
      ]
    },
    {
      "slug": "usa-gold-medals-paris-olympics-2024",
      "title": "All the ways Team USA dominated the Olympic medal table",
      "heading": "Team USA Paris Olympics | The Post",
      "publication": "The Washington Post",
      "time": "August 11, 2024",
      "filename": "USA_3.png",
      "description": "More than 40 percent of U.S. Olympians will leave Paris with a medal.",
      "content": [
        {
          "type": "text",
          "value": "<em>Read the original story on The Washington Post <a href=\"https://www.washingtonpost.com/sports/olympics/2024/08/11/usa-gold-medals-paris-olympics-2024/\">here</a>. </em>"
        },
        {
          "type": "text",
          "value": "PARIS — All 1,039 medals of the Olympic Games have been awarded, and the United States is leaving Paris with more than any other nation."
        },
        {
          "type": "text",
          "value": "The Americans won 126 medals, and because of team sports and relays, more than 40 percent of the team’s delegation of nearly 600 athletes received at least one. Forty-four American athletes won multiple medals and 110 won at least one gold, with that large number stemming from the country’s success in team events. In the final medal count, which awards one medal per event, the United States tied with China with 40 golds."
        },
        {
          "type": "text",
          "value": "All of the U.S. athletes who won at least four medals here are women — five swimmers, plus gymnast Simone Biles. If the medals are weighted based on the number of athletes on a team — for instance, a five-person gymnastics team on the podium would count as 0.2 medals per person — swimmer Regan Smith tops the U.S. ranks. Smith won three individual silver medals and two golds in relay events."
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/USA_1.png",
            "caption": "",
            "alt": "winner"
          }
        },
        {
          "type": "text",
          "value": "Athletes hailing from 41 states — plus one from the U.S. Virgin Islands — won medals for the United States."
        },
        {
          "type": "text",
          "value": "About one-fifth of U.S. athletes named California as their home state, and 48 of those Olympians left the Games with a medal. The majority was part of a team that finished on the podium, including the 12 Californians on the bronze-winning men’s water polo squad."
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/USA_2.png",
            "caption": "States with higher suicide rates are concentrated in the Midwest.",
            "alt": "state"
          }
        },
        {
          "type": "text",
          "value": "Montana and Alaska, which each had athletes claim at least three medals, ended the Games with the highest per capita haul."
        },
        {
          "type": "text",
          "value": "When weighted to account for the size of medal-winning teams, the D.C. metropolitan area contributed more to the U.S. medal count than any other region. Eleven athletes from the D.C. region — including sprinter Noah Lyles (Alexandria) and swimmers Katie Ledecky (Bethesda) and Torri Huske (Arlington) — won 19 medals in 18 events. Ledecky and Erin Gemmell (Potomac) were part of the team that claimed a silver medal in the women’s 4x200-meter freestyle."
        },
        {
          "type": "text",
          "value": "Smaller places such as Reno, Nev., (four medals from three athletes) and the Indianapolis region (eight medals from six athletes) outperformed their population size."
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/USA_3.png",
            "caption": "States with higher suicide rates are concentrated in the Midwest.",
            "alt": "metro"
          }
        },
        {
          "type": "text",
          "value": "While the United States topped the global medal standings, it finished 47th in medal count when population is taken into consideration. Usually, tiny countries that sometimes win just a single medal land near the top of these per capita rankings, but some larger nations, such as New Zealand, Hungary and Australia, also overperformed in Paris."
        },
        {
          "type": "text",
          "value": "<center><b>Caribbean island countries topped the per capita medal standings</b></center>"
        },
        {
          "type": "text",
          "value": "<center>Among countries with a population of at least 1 million, New Zealand won the most medals per capita.</center>"
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/USA_4.png",
            "caption": "States with higher suicide rates are concentrated in the Midwest.",
            "alt": "country"
          }
        }
      ]
    },
    {
      "slug": "h1b",
      "title": "Invisible Wall: How the H-1B Visa Process Creates Challenges for International Students in the US",
      "publication": "Personal Project",
      "time": "May 2023",
      "filename": "h-1b.jpg",
      "content": [
        {
          "type": "text",
          "value": "After obtaining his physics doctorate in physics degree from an Ivy League institution, Leo Zheng found it challenging to secure a job in the U.S. For eight months, he repeated the same routine every day: waking up early, browsing through LinkedIn, and submitting a job application every thirty minutes. As he grew increasingly hopeless and contemplated returning to China, he received an unexpected offer from Apple."
        },
        {
          "type": "text",
          "value": "But this still did not guarantee that he could stay and work in the U.S."
        },
        {
          "type": "text",
          "value": "In the 2022 fiscal year, over 478,000 individuals like Zheng submitted their H-1B visa petitions to the U.S. Citizenship and Immigration Services (USCIS), the federal agency that awards H-1B visas. Because of the overwhelming number of H-1B applications, the agency conducts a lottery system to determine which applications they will review. Ultimately, only 26.36% of the applicants qualified for review, a percentage that continues to decrease year after year."
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/h-1b.jpg",
            "caption": "In the 2022 fiscal year, over 478,000 individuals like Zheng submitted their H-1B visa petitions to the USCIS.",
            "alt": "H-1B visa people"
          }
        },
        {
          "type": "text",
          "value": "In 2020, the Trump administration implemented an overhaul of the H-1B visa program by moving the registration process online. This change resulted in a reduction of the petition fees to a mere $10. If an applicant was chosen in the lottery, they would be required to pay all the related visa fees to ensure that their application was reviewed in detail."
        },
        {
          "type": "text",
          "value": "Prior to this change, U.S. employers had to create full petitions for their candidates, which incurred costly fees to file, and then enter a lottery that usually commenced on April 1st."
        },
        {
          "type": "text",
          "value": "​​  The new registration system, however, significantly reduced the barriers to entry, potentially leading to the submission of duplicate applications."
        },
        {
          "type": "text",
          "value": "USCIS found that a few companies entered the same applicants into the lottery multiple times to artificially increase their chances of winning a visa. This caused a record-high demand of 781,000 entries for 85,000 visa slots this year."
        },
        {
          "type": "text",
          "value": "“Many individuals attempted to game the system by submitting multiple applications through different companies, causing a massive surge of 300,000 additional applications in 2023,\" said Chuck Guo, an immigration lawyer with six years of experience. \"This is unfair and dilutes the chances of others in the lottery.\""
        },
        {
          "type": "text",
          "value": "After graduation, international students typically use their \"Optional Practical Training\" to find a job, and then apply for an H-1B visa to legally work in the U.S. The H-1B visa, established in 1990, has been the primary way for companies to hire foreign employees with college degrees, including those who studied in the U.S."
        },
        {
          "type": "text",
          "value": "\"For the past 30 years, the U.S. has not updated its immigration laws, despite the population doubling and the economy growing twice as large during that time. However, the number of H-1B visas has not significantly increased.” said Guo."
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/h1b_map.png",
            "caption": "Both Texas and the Bay Area had three cities where employers filed more than 10,000 H-1B petitions in 2022.",
            "alt": "H-1B visa map"
          }
        },
        {
          "type": "text",
          "value": "According to Guo, he has noticed a significant increase in the scrutiny of legal immigrants by the immigration agency, resulting in longer processing times and unresponsive departments."
        },
        {
          "type": "text",
          "value": "There are also certain trends among H-1B applicants in terms of the cities and professions they apply for."
        },
        {
          "type": "text",
          "value": "Zheng explains that although international students studying STEM majors and eligible for three chances to participate in the H-1B lottery during their OPT period, they often work for positions such as \"software engineer\" or \"data scientist\" at large tech companies. In the past five years, over 60% of H-1B applicants have been employed in computer science and data science roles."
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/h1b_applications.png",
            "caption": "Over 60% of H-1B visa applicants work in CS-related jobs",
            "alt": "H-1B visa applications"
          }
        },
        {
          "type": "text",
          "value": "Additionally, H-1B applicants have relatively high average salaries. For instance, in 2022, H-1B applicants in California earned an average annual salary of over $120,000, with those in Washington and New York following closely behind at $114,000 and $97,000, respectively."
        },
        {
          "type": "text",
          "value": "\"This is a trend. The H-1B visa requires applicants to have a bachelor's degree or higher, so positions are often located in big cities. And the legal and immigration fees are not small amounts, so it's usually larger companies that apply,\" said Guo."
        },
        {
          "type": "text",
          "value": "Both Texas and the Bay Area had three cities where employers filed more than 10,000 H-1B petitions in 2022. In Texas, the cities were Austin, Plano, and Dallas. Meanwhile, New York City had the highest number of H-1B petitions filed by employers, with over 30,000."
        },
        {
          "type": "text",
          "value": "Even if you are selected for the H-1B lottery, it does not guarantee that you will receive the visa."
        },
        {
          "type": "text",
          "value": "Zheng encountered a problem when he applied for his H-1B visa. The immigration agency determined that his doctoral degree was not in line with data science and requested additional documentation."
        },
        {
          "type": "text",
          "value": "In recent years, the government has gradually lifted restrictions on H-1B visas, resulting in a higher approval rate during this period. In the 2022 fiscal year, the approval rate was 98%."
        },
        {
          "type": "text",
          "value": "The government has proposed increasing the registration fee to $215, which is expected to be effective for next year's lottery. Additionally, the agency intends to draft regulations to prevent future fraud."
        },
        {
          "type": "text",
          "value": "To attract global talent, Guo believes that the United States should have a more comprehensive and fair consideration for legal immigrants."
        }
      ]
    },
    {
      "slug": "ChinaAI",
      "title": "Hiring data tells you Top 10 Chinese Company in the race to hire AI Talent",
      "publication": "The Abacus",
      "time": "December 2023",
      "filename": "AI_talent1.jpg",
      "content": [
        {
          "type": "text",
          "value": "<em>This visualization was created using D3.js. Read the original story on The Abacus <a href=\"https://theabacus.substack.com/p/hiring-data-tells-you-top-10-chinese\">here</a>.</em>"
        },
        {
          "type": "text",
          "value": "I used MaiMai's report, a leading Chinese recruitment site, to analyze the AI job market and talent strategies of Chinese companies. Their latest insights (as of Oct 23) were quite revealing."
        },
        {
          "type": "text",
          "value": "First, let's look at the most in-demand AI positions in China. MaiMai's Talent supply-demand rate reveals that for two consecutive years, Autonomous Driving Systems Engineer, with a supply-demand ratio of 0.38, is the most sought-after role. This means there are about 2 candidates for every 5 positions."
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/AI_talent2.webp",
            "caption": "",
            "alt": "major-Chinese-company"
          }
        },
        {
          "type": "text",
          "value": "While there's some easing in AI role shortages compared to 2022, with speech recognition and AI engineers catching up quickly, algorithm engineers still have a supply-demand ratio below 0.5."
        },
        {
          "type": "text",
          "value": "And we have some new positions this year: ChatGPT Researchers! I wasn't sure what this job entails, so I checked some job search apps. The descriptions are vague, mostly about training chatbots for specific applications using ChatGPT. Despite the ambiguity, ChatGPT Researchers top the high-salary list with an average monthly wage of $10,000. (I promise to find some ChatGPT researchers to talk to for a future story!)"
        },
        {
          "type": "text",
          "value": "Next, let's check out the top 10 Chinese companies racing for AI talent."
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/ AI_talent3.webp",
            "caption": "",
            "alt": "AI position"
          }
        },
        {
          "type": "text",
          "value": "ByteDance is at the top again for posting the most AI jobs, even though they've slowed down a bit in the last two years. According to the report, this tech giant is a major player in the internet industry for both attracting and sourcing talent."
        },
        {
          "type": "text",
          "value": "Even smaller internet firms like Xiaohongshu and Meituan are diving into the AI talent hunt."
        },
        {
          "type": "text",
          "value": "As the chart shows, Alibaba's back in the game, picking up the pace in AI hiring. With their new CEO, Eddie Yongming Wu, on board since September, they're all about putting users first and driving with AI. Their AI job posts have shot up 4.6 times since 2022. Most of these gigs are at their e-commerce giant TaoTian Group, where they're crazy about hiring algorithm engineers – the demand's grown more than ten times over the past year"
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/AI_talent1.webp",
            "caption": "",
            "alt": "AI talent race"
          }
        }
      ]
    },
    {
      "slug": "us-pop",
      "title": "US Population New Change",
      "publication": "Personal Project",
      "time": "July 2023",
      "filename": "pop.gif",
      "content": [
        {
          "type": "text",
          "value": "<em>This visualization was created using Svelte.js. You can find the code here.</em>"
        },
        {
          "type": "text",
          "value": "In June 2023, the Census Bureau released new population data. I used Svelte.js to create this visualization. The data granularity extends to the county level. After processing the entire dataset in R, I selected the top 100 counties based on population to compare the changes from 2020 to 2022, hoping to discern post-pandemic migration trends across different parts of the United States."
        },
        {
          "type": "text",
          "value": "## How I Made This Visualization"
        },
        {
          "type": "text",
          "value": "Exploring visualization options. The states are divided into four main regions according to the 1950 Census Bureau standards: Northeast, South, Midwest, and West, represented in the visualization by blue, pink, yellow, and grey respectively."
        },
        {
          "type": "text",
          "value": "Each bubble represents a county. You can arrange the bubbles by state location. Click anywhere on the chart to interact. To enhance user interaction, the chart is responsive, includes hover interactions, and features meaningful peripheral elements."
        },
        {
          "type": "text",
          "value": "My data.js looks like this:"
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/pop_data.png",
            "caption": "population change",
            "alt": "population data"
          }
        },
        {
          "type": "text",
          "value": "<h3>Using D3-force for Svelte Visualizations</h3>"
        },
        {
          "type": "text",
          "value": "Before using D3-force, I generally apply fixed x and y positions to each circle. D3-force, like a physics engine, determines the position of each circle. I was inspired by Ben Tanen’s tutorial on ObservableHQ."
        },
        {
          "type": "text",
          "value": "For this chart, I wanted three forces: forceX, forceY, and forceCollide. I mapped the population change percentage column to the forceX when grouped by region and the forceY force. ForceCollide ensures no two circles overlap."
        },
        {
          "type": "text",
          "value": "<h3>Drawing Circles</h3>"
        },
        {
          "type": "text",
          "value": "I use SVG to draw circles. One important aspect is to use an {#each} block to iterate over our data. We also use the “g” element to wrap our inner chart, allowing us to add axes later and position them correctly."
        },
        {
          "type": "text",
          "value": "<h3>Making Circles Reactive and Responsive</h3>"
        },
        {
          "type": "text",
          "value": "I’m actually very confused about using the .on('tick') function. My bubbles always don’t fit in the window. The issue here is that the simulation is re-instantiated every time any of its constituent elements change. Because we are using $: to instantiate the simulation, we essentially overwrite the previous simulation with a new one every time we resize the window."
        },
        {
          "type": "text",
          "value": "<h3>Connecting Data with Circles</h3>"
        },
        {
          "type": "text",
          "value": "So far, I’ve connected each circle's y-position to its location and its x-position to its population change percentage. In this step, I connected the circle’s color to its grouping variable, which is location, and also connected the radius to its change percentage variable."
        },
        {
          "type": "text",
          "value": "<h3>Adding Legend and Tooltip</h3>"
        },
        {
          "type": "text",
          "value": "This step is more routine, designed to make the visualization more interactive. It only requires adding hover listeners."
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/pop.gif",
            "caption": "population change",
            "alt": "population change"
          }
        }
      ]
    },
    {
      "slug": "globe",
      "title": "Global Population Visualization",
      "publication": "Personal Project",
      "time": "August 2023",
      "filename": "globe.gif",
      "content": [
        {
          "type": "text",
          "value": "<em>This visualization was created using Svelte.js. You can find the code here.</em>"
        },
        {
          "type": "text",
          "value": "It’s another population project, but unlike the previous one, this time I aimed to visualize global population data. Creating an interactive globe was an ideal choice, allowing users to click and drag the globe to see population numbers for each country."
        },
        {
          "type": "text",
          "value": "The geographic data we used is from 110m.json files. The data format is as follows:"
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/globe_data.png",
            "caption": "population change",
            "alt": "globe data"
          }
        },
        {
          "type": "text",
          "value": "Here, \"id\" represents the ISO code, which I'll use to link the data. This is more reliable than using the country name."
        },
        {
          "type": "text",
          "value": "<h3>D3-Geo</h3>"
        },
        {
          "type": "text",
          "value": "I employed d3-geo for this project. D3-geo helps plot a set of values onto corresponding geographic locations. The general approach to using d3-geo involves four steps: 1) Create a projection function; 2) Create a path generator; 3) Render the country paths; 4) Add a globe."
        },
        {
          "type": "text",
          "value": "<h3>Responsive</h3>"
        },
        {
          "type": "text",
          "value": "Similar to the bubble visualization, we just need to create a .chart-container and use a dimension binding equal to the width."
        },
        {
          "type": "text",
          "value": "<h3>Styling the Globe</h3>"
        },
        {
          "type": "text",
          "value": "The next step is to add background color and fill the globe. I also added a subtle glow to the globe, achieved using an SVG drop shadow with feOffset, feGaussianBlur, and feMerge."
        },
        {
          "type": "text",
          "value": "<h3>Adding Data to the Globe</h3>"
        },
        {
          "type": "text",
          "value": "We now have a globe, but the data isn't embedded yet. In addition to importing data, I created a color scale that adjusts the fill of each country based on population density. The brighter the color, the lower the population, and vice versa."
        },
        {
          "type": "text",
          "value": "<h3>Rotating</h3>"
        },
        {
          "type": "text",
          "value": "This animation is a bit complex. I envision that when the user is not interacting with the page, the globe will automatically rotate. Once an interaction event is triggered, the user can drag the globe to explore different countries."
        },
        {
          "type": "text",
          "value": "For auto-rotation, I use d3-timer. We're instantiating the rotation to be 0, and then updating it by 0.5 degrees every second."
        },
        {
          "type": "text",
          "value": "For drag functionality, I use d3-drag. This module allows us to add drag events to any DOM element. It's worth noting that we set the rotation on the x-axis first—don't forget to add yRotation. Additionally, for a globe, adding inertia is better. I use a spring function for this; the spring works by taking an initial value and a set of options, including stiffness and damping."
        },
        {
          "type": "text",
          "value": "<h3>Other works</h3>"
        },
        {
          "type": "text",
          "value": "To enhance the experience further, we still have many things we can do, like styling the cursor when the user is dragging the globe or adding interactive tooltips to provide more information."
        },
        {
          "type": "img",
          "value": {
            "filename": "../img/data-viz-photo/globe.gif",
            "caption": "global population",
            "alt": "globe population"
          }
        }
      ]
    }
  ],
  "maps": [
    {
      "slug": "arizona_heat",
      "title": "Extreme Heat And Migration: Insights From The Arizona Border",
      "publication": "School Project",
      "time": "2023 Fall",
      "image": "Arizona_heat",
      "description": [
        {
          "type": "text",
          "value": "The US Southwestern border is increasingly recognized as one of the world's most perilous land crossings. Alongside the myriad challenges faced by undocumented migrants, extreme heatwaves have emerged as a formidable barrier. Recently, there's been an increase in deaths caused by extreme heat, as noted by U.S. Customs and Border Protection."
        },
        {
          "type": "text",
          "value": "As a data reporter, I hope to provide more quantitative analysis and map visualizations to support these migrant stories. My project aims to understand how rising global temperatures affect migrant movements in this region. It will look at how water and emergency beacons are spread across the area, with the goal of finding ways to make the journey safer for migrants."
        },
        {
          "type": "text",
          "value": "Firstly, here is some background. I gathered weather data from NOAA and migrant information from the International Organization for Migration (IOM) and used R to analyze them. As Figure 1 shows, from 2019 to 2023, during the hottest months of June to September, there has been a notable increase in deaths among migrants trying to cross borders without permission. So, how do rising temperatures influence migration patterns along the Arizona border?"
        },
        {
          "type": "text",
          "value": "We define missing migrants as individuals who attempt to cross borders without authorization and are later found deceased by non-governmental organizations (NGOs) or patrol officers, without definitive identification at the time of discovery. Heat-related missing migrants are those whose deaths are inferred to be caused by heat, after excluding known causes like violence or drowning."
        },
        {
          "type": "text",
          "value": "Since data on missing migrants is difficult to obtain and the specific reasons for their disappearance are often unknown, I reached out to the International Organization for Migration and an Arizona local NGO, Humane Borders, for their datasets. To increase accuracy, I focused on missing migrant cases from June to September, the hottest months in Arizona. I also narrowed down the data to include cases that could be related to heat-related causes of death."
        },
        {
          "type": "text",
          "value": "Figure 2 provides very rich information, through this map, we can get some facts about Arizona: 1) Arizona is characterized by limited water sources and cities concentrated in the central region. 2) Tucson has become one of the fastest-growing cities in recent years due to immigration. 3) It has two patrol stations. 4) Rescue Beacons are primarily located in the lower-left corner, in Yuma County."
        },
        {
          "type": "text",
          "value": "I use the Heat Index and Geographically Weighted Regression (GWR) as the main methods for this research. For my research on the impact of heat, I initially planned to use temperature and other weather data. However, I realized that this data might not clearly show trends over five years."
        },
        {
          "type": "text",
          "value": "Then, I discovered the Heat Index in a research paper. Heat Index made by the nonprofit First Street Foundation, calculates the heat risk facing each property in the contiguous United States over the next 30 years, the length of a typical mortgage, providing some of the most detailed nationwide estimates. It uses an average temperature value over seven years, making it a more objective choice for my project. To analyze the data, I'm applying a weighted approach to the Heat Index."
        },
        {
          "type": "text",
          "value": "As the map indicates, the deep red areas represent the hottest regions, while the lighter colored areas are relatively cooler. However, it's important to note that when looking at the national map, Arizona tends to be overall warmer in the summer. The colorful points on the map represent missing migrants, with different colors indicating different years."
        },
        {
          "type": "text",
          "value": "Finally, I conducted a Geographically Weighted Regression (GWR), combining factors such as heat, distance from cities, and the presence of rescue beacons, to see how they influence migrant safety. I gained some insights from the results. Migrants should avoid walking in the FID4, 1, and 51 census tracts to minimize health risks. Additionally, NGOs and the US Border Patrol should consider installing more beacons eastward to enhance safety."
        },
        {
          "type": "text",
          "value": "So far, this is all my work. I sent the results to Humane Borders, hoping it can contribute to their efforts in helping undocumented immigrants protect their lives. Of course, this project has many limitations, such as my inability to verify the migrant data since statistics on heat-related deaths are hard to compile. Also, the heat index data was last updated in July, not including data for August and September."
        },
        {
          "type": "text",
          "value": "In the future, I aim to extend the study to encompass the entire US southern border for a more comprehensive analysis."
        }
      ]
    },
    {
      "slug": "vacant_land",
      "title": "Re-use Cleveland Vacant Land",
      "label": "Geographically Weighted Regression analysis",
      "image": "image1",
      "description": [
        {
          "type": "text",
          "value": "Cleveland, Ohio - along with many other post-industrial rust-belt cities—has a unique problem: how to cope with a shrinking population. The city has experienced a 56% reduction in overall population since 1950, leaving the city with nearly 20,000 neglected vacant lots. Cleveland has been attempting to “re-use” vacant land in creative ways through municipal “landbanking.” Vacant land re-use projects include small-scale economic development, residential construction, community gardens, public parks, and environmental remediation. The impact of these projects can be significant in terms of improving neighborhood quality of life for residents."
        },
        {
          "type": "text",
          "value": "This project involves creating maps to support a grant application to the U.S. Department of Housing and Urban Development (HUD). The city is seeking funding to support its vacant-land re-use strategy and aims to showcase the progress made to date. I will demonstrate whether the strategy of neighborhood revitalization through vacant-land reuse is reaching Cleveland’s most vulnerable (and vacant!) neighborhoods."
        },
        {
          "type": "text",
          "value": "I am tasked specifically with evaluating the success of vacant land re-use in relation to the overall social opportunity index and then delving more deeply into projects that could impact public health."
        }
      ]
    },
    {
      "slug": "event_venue",
      "title": "event venue",
      "label": "Geocoding; Spatial analysis",
      "image": "image2",
      "description": [
        {
          "type": "text",
          "value": "FLUX is an acclaimed annual art event in Pittsburgh, Pennsylvania, that highlights emerging artists. This year, faced with budget cuts, the event organizers have hired a marketing analyst to efficiently target potential attendees using limited data on past participation."
        },
        {
          "type": "text",
          "value": "The analyst's task is to analyze spatial data to find where previous attendees live, identifying clusters for focused marketing and at least one zip code for concentrated outreach. Additionally, the analyst may suggest a suitable location for the next event. This approach uses geocoding, cluster analysis, and hot spot analysis to overcome budget constraints and maintain the event's high standard."
        }
      ]
    }
  ],
  "blog": [
    {
      "slug": "arpa",
      "title": "What I Learned from the ARPA Project",
      "time": "December, 2024",
      "filename": "arpa_treasury.jpg",
      "description": "The project dealt with messy government data and a ton of manual coding. Data validation? A must.",
      "content": []
    }
  ]
}
